In [1]:
import numpy as np
import pandas as pd

In [2]:
df=pd.DataFrame({
    "city":["New York",None,"Paris","London",None,"Tokyo"],
    "Country":["USA","Canada",None,"UK","France","Japan"]
})

In [3]:
df

       city Country
0  New York     USA
1      None  Canada
2     Paris    None
3    London      UK
4      None  France
5     Tokyo   Japan

In [4]:
df

       city Country
0  New York     USA
1      None  Canada
2     Paris    None
3    London      UK
4      None  France
5     Tokyo   Japan

In [6]:
df.dropna(subset=["city"],inplace=True)

In [7]:
df

       city Country
0  New York     USA
2     Paris    None
3    London      UK
5     Tokyo   Japan

In [8]:
df.head(1)

       city Country
0  New York     USA

In [9]:
df.tail(1)

    city Country
5  Tokyo   Japan

In [12]:
df.describe()

            city Country
count          4       3
unique         4       3
top     New York     USA
freq           1       1

In [13]:
df.describe

<bound method NDFrame.describe of        city Country
0  New York     USA
2     Paris    None
3    London      UK
5     Tokyo   Japan>

In [16]:
df1=pd.DataFrame({
    "City":["Patna","Mumbai","Bangalore","Patna","Muzaffarpur","Lucknow"],
    "State":["Bihar","Maharashtra","Karnatka","Bihar","Bihar","Uttar Pardesh"]
})

In [17]:
df1

          City          State
0        Patna          Bihar
1       Mumbai    Maharashtra
2    Bangalore       Karnatka
3        Patna          Bihar
4  Muzaffarpur          Bihar
5      Lucknow  Uttar Pardesh

In [21]:
df2=df1.drop_duplicates(subset=["City"])

In [22]:
df2

          City          State
0        Patna          Bihar
1       Mumbai    Maharashtra
2    Bangalore       Karnatka
4  Muzaffarpur          Bihar
5      Lucknow  Uttar Pardesh

In [24]:
df2.reset_index()

   index         City          State
0      0        Patna          Bihar
1      1       Mumbai    Maharashtra
2      2    Bangalore       Karnatka
3      4  Muzaffarpur          Bihar
4      5      Lucknow  Uttar Pardesh